{
  "helpPanelContents.downloadParamFile": "Help contents for download param file panel.",
  "helpPanelContents.hint": "The installation assistant dialog asks for information relating to the target system and installation parameters of the Linux distribution to be installed. Be sure to obtain this data before continuing.",
  "helpPanelContents.information": "Review the minimum hardware requirements for the selected Linux distribution before continuing with the installation.\n\nIf the target system does not meet all of these requirements, the installation may fail.",
  "helpPanelContents.inputFileSelection": "Select the Linux distribution type and version that you want to install. This choice will affect the format of the resulting installer parameter file.\n\nNote that installer parameter file formats differ between distribution types, and may change with newer versions of the same type. In case the exact version is not available for selection, choose the same distribution type and closest version that is lower than the one to be installed.",
  "helpPanelContents.installationParameters": "Help contents for installation parameters panel.",
  "helpPanelContents.networkAddress": "Enter network address information for the target host in this panel. First select the IP version – either IPv4 or IPv6. Depending on the IP version, IP addresses have a different format:\n- IPv4 addresses consist of 4 decimal numbers separated by dots, for example \"192.168.0.1\"\n- IPv6 addresses consist of up to 8 hexadecimal numbers separated by colons, for example \"fd00::1a\"\n\nNext, enter the IP address information:\n- Host IP address and prefix or netmask: the IP address assigned to the target host\n- Gateway IP address: the address of an IP gateway that the host can use to reach other networks\n- Nameserver IP address: the address of a DNS server to use for resolving host names into IP addresses\n- Host name: an optional name to be associated with the host\n",
  "helpPanelContents.networkDevice": "These parameters specify the network device to use for accessing the installation media and for providing access to the interactive installer.\n\nFirst select the type of network device that is available in the target system. Depending on the type, the dialog will ask for different parameters.\n\nTypes:\n1. Open Systems Adapter (OSA)\n2. PCI RDMA over Converged Ethernet (RoCE)\n\nFor OSA, specify the network device by listing the associated three device numbers. The number format is 0.x.y where \"x\" is the device subchannel ID and \"y\" is the device number, both in hexadecimal format. Note that device numbers are typically sequential.\n\nAdditional OSA parameters:\n- Layer 2: Select 1 if the network device is operating in ethernet mode, 0 if in IP mode.\n- Port number: Specify the port number to use for devices that support multiple network ports.\n\nFor RoCE, specify the network device by either of two device IDs, the PCI function ID (FID) or the User-defined identifier (UID). Both IDs are hexadecimal numbers. Specify the UID if the target system has the partition UID uniqueness setting enabled, otherwise specify the FID.\n\nIf the network is configured as a Virtual LAN, enable the VLAN toggle and enter the matching VLAN-ID.",
  "helpPanelContents.nextSteps": "Help contents for next steps panel."
}
