{
    "helpPanelContents.downloadParamFile": "The text area contains the resulting installation parameter file. If you are familiar with the file format, you can make manual changes.\n\n<strong>Warning: Manual changes will render any previous step in read only mode. You will need to discard your changes to be able to modify existing data on previous steps.</strong>\n\nAdditional information can be displayed if any input data looks incorrect or is missing:\n- Steps with incomplete data: Review your input on the listed panels for completeness\n- Steps with invalid data: Review your input on the listed panels for correctness\nTo start the installation, copy the parameter file contents, or save it to a file and proceed with the steps outlined in the next panel.",
    "helpPanelHeader.downloadParamFile": "Review parameter file",
    "helpPanelContents.hint": "The installation assistant dialog asks for information relating to the target system and installation parameters of the Linux distribution to be installed. This information is typically provided by hardware or network administrators of the system to be installed. Be sure to obtain this data before continuing.",
    "helpPanelHeader.hint": "Required information",
    "helpPanelContents.information": "Review the minimum system requirements for the selected Linux distribution before continuing with the installation.\n\nIf the target system does not meet all of these requirements, the installation may fail.",
    "helpPanelHeader.information": "Prepare required information",
    "helpPanelContents.inputFileSelection": "Select the Linux distribution type and version that you want to install. This choice will affect the format of the resulting installer parameter file.\n\nNote that installer parameter file formats differ between distribution types, and may change with newer versions of the same type. In case the exact version is not available for selection, choose the same distribution type and closest version that is lower than the one to be installed.",
    "helpPanelHeader.inputFileSelection": "Select the Linux distribution",
    "helpPanelContents.installationParameters": "During the installation process, the Linux installer requires additional files from the installation medium. These files must be provided through a network protocol by a server that contains an exact copy of the installation media contents.\n\nSpecify the URL to access installation files in the Installation address input field. Supported protocols are FTP, HTTP, and HTTPS. Use the \"Username\" and \"Password\" fields to specify access information if required. Passwords need to contain at least one number and one special character.\n\nNote: Passwords are in clear text in the resulting parameter file. The passwords are also stored in the browser's local storage as obfuscated strings. Use \"Clear settings\" menu item in the About this app menu under the Linux penguin icon to delete application data from the browser's local storage.\n\nWhen the installation is started, the installer can be controlled either through a VNC-based GUI, or an SSH text-based interface.\n\nSet the Start VNC installation toggle to yes and specify an optional password to enable the graphical installation.\n\nSet the Start SSH installation toggle to enable text-based installation. Not all installer options may be available when using the text-based interface.",
    "helpPanelHeader.installationParameters": "Designate installation source",
    "helpPanelContents.networkAddress": "Enter network address information for the target host in this panel. First select the IP version – either IPv4 or IPv6. Depending on the IP version, IP addresses have a different format:\n\n- IPv4 addresses consist of 4 decimal numbers separated by dots, for example \"192.168.0.1\"\n- IPv6 addresses consist of up to 8 hexadecimal numbers separated by colons, for example \"fd00::1a\"\n\nNext, enter the IP address information:\n\n- Host IP address and prefix or netmask: the IP address assigned to the target host\n- Gateway IP address: the address of an IP gateway that the host can use to reach other networks\n- Nameserver IP address: the address of a DNS server to use for resolving host names into IP addresses\n- Host name: an optional name to be associated with the host\n",
    "helpPanelHeader.networkAddress": "Specify network address",
    "helpPanelContents.networkDevice": "Specify the network device to use for accessing the installation media and to access the interactive installer.\n\nFirst select the type of network device that is available in the target system. Depending on the type, the dialog will ask for different parameters.\n\nTypes:\n1. Open Systems Adapter (OSA)\n2. PCI RDMA over Converged Ethernet (RoCE)\n\nFor OSA connections, specify the device bus-IDs that correspond to the read, write, and data subchannels. The device bus-IDs are of the format 0.x.y, where x is the subchannel set ID, and y is the device number.\n\nAdditional OSA parameters:\n- OSI Layer: Select Layer 2 if the network device is operating in Ethernet mode, or Layer 3 if it is operating in IP mode.\n- Port number: For adapters with multiple ports per CHPID, select port 0 or 1.\n\nFor RoCE, you can specify the network device either by the PCI function ID (FID), or the User-defined identifier (UID). Specify the UID if the target system has the partition UID uniqueness setting enabled, otherwise specify the FID. Both IDs are hexadecimal numbers.\n\nIf the network is configured as a virtual LAN, use the toggle button to enable the VLAN setting, and enter the VLAN ID.",
    "helpPanelHeader.networkDevice": "Specify network device",
    "helpPanelContents.nextSteps": "To start the installation, follow the steps listed on this panel.",
    "helpPanelHeader.nextSteps": "Next steps",
    "helpPanelContents.summary": "To download the generated parameter file, set the Download parameter file toggle to yes and click Create. Alternatively, you can download the generated parameter file at any time from the landing page where you initially started the parameter file creation workflow.",
    "helpPanelHeader.summary": "Summary",
    "helpPanelContents.intro": "Set the Use existing settings toggle to Yes (default) to use existing settings from a previous session. You can then tailor a parameter file to your needs.\n\nSet the Use existing settings toggle to No to purge any existing settings and start composing a new parameter file from scratch.",
    "helpPanelHeader.intro": "Use existing settings",
    "helpPanelContents.landingPage": "You require the information listed here to compose parameter files. If you created a parameter file in a previous session, you can either modify it or discard it to create a new parameter file.\n\nParameter files from a previous session, if any, can be downloaded using the appropriate button on the \"Start composing\" card.",
    "helpPanelHeader.landingPage": "Getting started",
    "helpPanelContents.errorPage": "First review the known issues page, then submit an issue if you cannot find a solution.\n\nBoth the known issues page and the submit issue page are linked on the error page.\n\nNote: The link on the error page to submit a new issue will pre populate the issue to be created with the data available on the error page.\n\nThe links can also be found under the Linux penguin icon on the About this app menu.\n\nWhen submitting an issue, remember that the browser console might contain relevant information to include.",
    "helpPanelHeader.errorPage": "What to do next"
}
